#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
[0m[1mibm_cr_namespace.cr_namespace: Refreshing state... [id=ibm-daniels-workspace][0m
[0m[1mibm_container_cluster.cluster: Refreshing state... [id=c7c8q75f06gbtnue8ss0][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # ibm_container_cluster.cluster[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "ibm_container_cluster" "cluster" {
        [1m[0mid[0m[0m                          = "c7c8q75f06gbtnue8ss0"
        [1m[0mname[0m[0m                        = "tfcluster-daniel"
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                   = []
        [1m[0mtags[0m[0m                        = []
        [90m# (32 unchanged attributes hidden)[0m[0m


        [90m# (2 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
 [36m<=[0m read (data resources)
[0m
Terraform will perform the following actions:

[1m  # data.ibm_container_cluster_config.cluster_config[0m will be read during apply
  # (config refers to values not yet known)[0m[0m
[0m [36m<=[0m[0m data "ibm_container_cluster_config" "cluster_config"  {
      [31m-[0m [0m[1m[0madmin[0m[0m                   = false [90m->[0m [0m[90mnull[0m[0m
      [32m+[0m [0m[1m[0madmin_certificate[0m[0m       = (sensitive value)
      [32m+[0m [0m[1m[0madmin_key[0m[0m               = (sensitive value)
      [33m~[0m [0m[1m[0mca_certificate[0m[0m          = (sensitive value)
      [32m+[0m [0m[1m[0mcalico_config_file_path[0m[0m = (known after apply)
      [33m~[0m [0m[1m[0mcluster_name_id[0m[0m         = "c7c8q75f06gbtnue8ss0" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mconfig_dir[0m[0m              = "/Users/danielgeerts" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mconfig_file_path[0m[0m        = "/Users/danielgeerts/5bbbbab4aa870470f86236dc89c6e2a51ac52c08d3cabc57a8a651e5c9693338_c7c8q75f06gbtnue8ss0_k8sconfig/config.yml" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mdownload[0m[0m                = true [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mhost[0m[0m                    = "https://c109.eu-de.containers.cloud.ibm.com:31404" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                      = "c7c8q75f06gbtnue8ss0" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mnetwork[0m[0m                 = false [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtoken[0m[0m                   = (sensitive value)
    }

[1m  # ibm_container_cluster.cluster[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "ibm_container_cluster" "cluster" {
      [33m~[0m [0m[1m[0malbs[0m[0m                         = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcrn[0m[0m                          = "crn:v1:bluemix:public:containers-kubernetes:eu-de:a/0e74846848c34ebe806bca0ad18e63d4:c7c8q75f06gbtnue8ss0::" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdatacenter[0m[0m                   = "mil01" [33m->[0m [0m"fra02" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                           = "c7c8q75f06gbtnue8ss0" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mingress_hostname[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mingress_secret[0m[0m               = (sensitive value)
      [33m~[0m [0m[1m[0mlabels[0m[0m                       = {} [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                         = "tfcluster-daniel"
      [33m~[0m [0m[1m[0mpod_subnet[0m[0m                   = "172.30.0.0/16" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_service_endpoint[0m[0m     = false [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mprivate_service_endpoint_url[0m[0m = (known after apply)
      [31m-[0m [0m[1m[0mprivate_vlan_id[0m[0m              = "2218181" [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mpublic_service_endpoint[0m[0m      = true [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpublic_service_endpoint_url[0m[0m  = "https://c109.eu-de.containers.cloud.ibm.com:31404" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mpublic_vlan_id[0m[0m               = "2218179" [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mregion[0m[0m                       = "eu-de" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_controller_url[0m[0m      = "https://cloud.ibm.com/kubernetes/clusters" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_crn[0m[0m                 = "crn:v1:bluemix:public:containers-kubernetes:eu-de:a/0e74846848c34ebe806bca0ad18e63d4:c7c8q75f06gbtnue8ss0::" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_id[0m[0m            = "6ba302522b1c421db57479f31d859657" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_group_name[0m[0m          = "Default" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_name[0m[0m                = "tfcluster-daniel" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mresource_status[0m[0m              = "normal" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mserver_url[0m[0m                   = "https://c109.eu-de.containers.cloud.ibm.com:31404" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mservice_subnet[0m[0m               = "172.21.0.0/16" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0msubnet_id[0m[0m                    = [] [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtags[0m[0m                         = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mworker_pools[0m[0m                 = [
          [31m-[0m [0m{
              [31m-[0m [0mhardware      = "public"
              [31m-[0m [0mid            = "c7c8q75f06gbtnue8ss0-2b0abc5"
              [31m-[0m [0mlabels        = {
                  [31m-[0m [0m"ibm-cloud.kubernetes.io/worker-pool-id" = "c7c8q75f06gbtnue8ss0-2b0abc5"
                }
              [31m-[0m [0mmachine_type  = "free"
              [31m-[0m [0mname          = "default"
              [31m-[0m [0msize_per_zone = 1
              [31m-[0m [0mstate         = "active"
              [31m-[0m [0mzones         = [
                  [31m-[0m [0m{
                      [31m-[0m [0mprivate_vlan = "2218181"
                      [31m-[0m [0mpublic_vlan  = "2218179"
                      [31m-[0m [0mworker_count = 1
                      [31m-[0m [0mzone         = "mil01"
                    },
                ]
            },
        ] [33m->[0m [0m(known after apply)
        [90m# (12 unchanged attributes hidden)[0m[0m


      [33m~[0m [0mworkers_info {
          [33m~[0m [0m[1m[0mid[0m[0m        = "kube-c7c8q75f06gbtnue8ss0-tfclusterda-default-0000000c" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mpool_name[0m[0m = "default" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mversion[0m[0m   = "1.21.7" [33m->[0m [0m(known after apply)
        }
        [90m# (1 unchanged block hidden)[0m[0m
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0mcluster_config_file_path[0m[0m = "/Users/danielgeerts/5bbbbab4aa870470f86236dc89c6e2a51ac52c08d3cabc57a8a651e5c9693338_c7c8q75f06gbtnue8ss0_k8sconfig/config.yml" [33m->[0m [0m(known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: apply_this.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "apply_this.tfplan"
```

</details>

*Pusher: @danielgeerts7, Action: `pull_request`, Working Directory: ``, Workflow: `Orchestration (Terraform)`*